tangleDocs/emacs.org
#+TITLE: Emacs config file
#+AUTHOR: Samuel Jackson
#+DESCRIPTION: This file defines all my emacs configurations for my doom emacs setup.
#+STARTUP: overview num hidestars indent
#+PROPERTY: header-args :results silent :tangle "../configs/.doom.d/config.el"

Welcome to a semi-clean though certainly flawed emacs config. I hope you can find what you're looking for. Feel free to reach out if you have any questions or recommendations!

Unlike other literate configs, this one is not meant to be compiled at start time. This gets tangled together whenever it is saved and then can be compiled further using ~doom sync~ or ~SPC h r r~.

* Table of contents                                         :quote:toc_9:
#+BEGIN_QUOTE
- [[#file-setup][File setup]]
  - [[#initialization][Initialization]]
  - [[#packages][Packages]]
  - [[#configuration][Configuration]]
    - [[#benchmarking][Benchmarking]]
- [[#doom-initialization][Doom Initialization]]
  - [[#documentation][Documentation]]
  - [[#start][Start]]
  - [[#input][Input]]
  - [[#completion][Completion]]
  - [[#ui][UI]]
  - [[#editor-tools][Editor tools]]
  - [[#emacs][Emacs]]
  - [[#terminals][Terminals]]
  - [[#checkers][Checkers]]
  - [[#tools][Tools]]
  - [[#os][OS]]
  - [[#programming-languages][Programming Languages]]
  - [[#email][Email]]
  - [[#app][App]]
  - [[#config][Config]]
  - [[#end-section][End section]]
- [[#configuration-1][Configuration]]
  - [[#documentation-1][Documentation]]
    - [[#macro-documentation][Macro documentation]]
    - [[#packages-documentation][Packages documentation]]
  - [[#basic-emacs-settings][Basic Emacs settings]]
    - [[#personal-identification][Personal Identification]]
    - [[#fonts-and-language][Fonts and language]]
      - [[#chinese-support][Chinese support]]
      - [[#fonts][Fonts]]
        - [[#nerd-fonts][Nerd Fonts]]
      - [[#text-properties][Text properties]]
    - [[#custom-settings-file][Custom settings file]]
    - [[#theming][Theming]]
    - [[#debugging][Debugging]]
    - [[#mode-line][Mode line]]
      - [[#date-and-time][Date and time]]
      - [[#battery][Battery]]
      - [[#encoding-format][Encoding format]]
    - [[#auth-settings][Auth settings]]
  - [[#key-chord-setup][Key-chord setup]]
    - [[#modifier-keys-mapping][Modifier keys mapping]]
    - [[#key-discovery][Key discovery]]
      - [[#which-key][Which key]]
      - [[#embark][Embark]]
    - [[#evil-mode][Evil mode]]
      - [[#evil-settings][Evil settings]]
      - [[#evil-snipe-mode][Evil snipe mode]]
        - [[#snipe-mode-off-by-default][Snipe mode off by default]]
        - [[#settings][Settings]]
        - [[#new-keybinding][New keybinding]]
  - [[#file-management-and-selection][File management and selection]]
    - [[#file-tree-viewer][File tree viewer]]
    - [[#treemacs][Treemacs]]
    - [[#sidebar-file-explorer][Sidebar file explorer]]
    - [[#scratch-buffer][Scratch buffer]]
    - [[#directory-navigation][Directory navigation]]
    - [[#vlf-very-large-files][VLF (Very Large Files)]]
    - [[#file-info][File info]]
  - [[#workspace-management][Workspace management]]
    - [[#perspectives][Perspectives]]
    - [[#tab-bar-mode][Tab bar mode]]
    - [[#projectile][Projectile]]
    - [[#project-other][Project (other)]]
  - [[#windows][Windows]]
    - [[#window-splitting][Window splitting]]
    - [[#resizing-windows][Resizing windows]]
    - [[#window-zooming][Window zooming]]
    - [[#window-switching][Window switching]]
  - [[#buffers][Buffers]]
    - [[#buffer-display][Buffer display]]
      - [[#line-numbering][Line numbering]]
      - [[#whitespace-mode][Whitespace mode]]
      - [[#line-spacing][Line spacing]]
      - [[#tree-sitter-mode][Tree Sitter mode]]
      - [[#code-folding][Code folding]]
        - [[#ts-fold][TS-Fold]]
          - [[#setup][Setup]]
          - [[#go-folding][Go Folding]]
          - [[#yaml-folding][Yaml Folding]]
          - [[#js-folding][JS Folding]]
          - [[#java-folding][Java Folding]]
          - [[#shell-folding][Shell Folding]]
          - [[#python-folding][Python Folding]]
        - [[#origami-folding][Origami folding]]
        - [[#fold-from-anywhere-on-line][Fold from anywhere on line]]
        - [[#tab-as-fold-toggling][Tab as fold toggling]]
      - [[#fill-column][Fill column]]
      - [[#minimap][Minimap]]
    - [[#working-within-a-buffer][Working within a buffer]]
      - [[#undo][Undo]]
      - [[#writing][Writing]]
        - [[#spell-fu][Spell-fu]]
        - [[#abbreviations][Abbreviations]]
        - [[#snippets][Snippets]]
          - [[#academic-writing][Academic writing]]
        - [[#text-filler][Text filler]]
          - [[#lorem-ipsum][Lorem-ipsum]]
        - [[#write-good-mode][Write good mode]]
        - [[#flycheck-mode][Flycheck mode]]
        - [[#clipboard][Clipboard]]
      - [[#movement][Movement]]
        - [[#logical-lines][Logical lines]]
        - [[#sub-word-movement][Sub-word movement]]
        - [[#scrolling][Scrolling]]
        - [[#centered-cursor--typewriter-mode][Centered Cursor / Typewriter Mode]]
        - [[#logos][Logos]]
        - [[#returning-from-a-jump][Returning from a jump]]
      - [[#encrypt-region][Encrypt region]]
      - [[#searching][Searching]]
        - [[#case-insensitive-search][Case insensitive search]]
        - [[#rip-grep][Rip-grep]]
        - [[#bang][Bang!]]
        - [[#imenu][Imenu]]
      - [[#lsp-servers][LSP servers]]
        - [[#lsp-settings][lsp settings]]
        - [[#lsp-ui][LSP ui]]
        - [[#lsp-peek][LSP peek]]
        - [[#lsp-ui-docs][LSP ui docs]]
        - [[#key-bindings][Key bindings]]
        - [[#golang][Golang]]
  - [[#independent-or-external-programs][Independent or external programs]]
    - [[#version-control][Version control]]
      - [[#inline-blame][Inline blame]]
        - [[#styling-for-magit][Styling for magit]]
      - [[#sideline-blame][Sideline blame]]
      - [[#diff][Diff]]
      - [[#gutter][Gutter]]
    - [[#discord-integration][Discord integration]]
    - [[#speed-reading][Speed reading]]
    - [[#presentations][Presentations]]
      - [[#key-cast][Key cast]]
      - [[#gif-screenshot][Gif Screenshot]]
      - [[#command-log-mode][Command log mode]]
    - [[#kubernetes][Kubernetes]]
      - [[#kubel][Kubel]]
    - [[#bluetooth][Bluetooth]]
    - [[#collaborative-editing][Collaborative editing]]
    - [[#startup-profiling][Startup profiling]]
  - [[#modepackage-settings][Mode/package settings]]
    - [[#mode-minder][Mode Minder]]
    - [[#elisp-shell][Elisp-shell]]
      - [[#elisp-shell-aliases][Elisp shell aliases]]
      - [[#eshell-functions][Eshell functions]]
      - [[#prompt-as-page-delimiter][Prompt as page delimiter]]
    - [[#org-mode][Org mode]]
      - [[#org-add-on-packages][Org add-on packages]]
      - [[#general-org-settings][General Org settings]]
        - [[#standard-org-settings][Standard org settings]]
        - [[#font-support][Font support]]
        - [[#org-mode-keybindings][Org mode keybindings]]
        - [[#shortcut-to-open-org-files][Shortcut to open org files]]
        - [[#tags][Tags]]
      - [[#babel][Babel]]
        - [[#clojure][Clojure]]
        - [[#http][HTTP]]
      - [[#org-roam][Org Roam]]
        - [[#ui-1][UI]]
      - [[#timers-and-clock][Timers and clock]]
      - [[#org-agenda][Org Agenda]]
        - [[#agenda-files][Agenda files]]
      - [[#pomodoro][Pomodoro]]
        - [[#begin-after-org][Begin "after! org"]]
        - [[#work-length][Work length]]
        - [[#sounds-to-play][Sounds to play]]
        - [[#sounds-to-use][Sounds to use]]
        - [[#end-of-after-org][End of "after! org"]]
      - [[#org-present][Org Present]]
        - [[#supporting-packages][Supporting packages]]
      - [[#org-capture][Org Capture]]
        - [[#settings-1][Settings]]
        - [[#org-template][Org template]]
          - [[#example-template-code][Example template code]]
      - [[#org-chef][Org Chef]]
      - [[#org-graph][Org graph]]
      - [[#org-gantt][Org Gantt]]
      - [[#org-verb][Org verb]]
    - [[#e-book-reader][E-book reader]]
      - [[#packages-1][Packages]]
      - [[#settings-2][Settings]]
  - [[#programming-languages-1][Programming Languages]]
    - [[#open-cad][Open CAD]]
    - [[#go-mode][Go mode]]
    - [[#python][Python]]
    - [[#emacs-lisp][Emacs Lisp]]
    - [[#scheme][Scheme]]
    - [[#javascript][Javascript]]
      - [[#eslint][Eslint]]
      - [[#prettier][Prettier]]
    - [[#gitlab-ci][Gitlab CI]]
    - [[#vimrc][Vimrc]]
    - [[#sed][Sed]]
    - [[#jq][jq]]
    - [[#json][Json]]
    - [[#graphviz][Graphviz]]
    - [[#systemd][Systemd]]
    - [[#general-interpreter][General interpreter]]
      - [[#tabnine][TabNine]]
    - [[#web-mode][Web mode]]
    - [[#r-data-frames][R data frames]]
    - [[#guix][Guix]]
  - [[#fun][Fun]]
    - [[#xkcd][XKCD]]
    - [[#typewriter][Typewriter]]
    - [[#games][Games]]
      - [[#steam][steam]]
      - [[#2048-game][2048-game]]
      - [[#mines][mines]]
      - [[#minesweeper][minesweeper]]
      - [[#sudoku][sudoku]]
      - [[#threes][threes]]
      - [[#pacmacs][Pacmacs]]
      - [[#wordel][Wordel]]
      - [[#gnu-go][GNU Go]]
    - [[#fireplace][Fireplace]]
    - [[#power-mode][Power mode!]]
  - [[#experimental-personal-functions][Experimental personal functions]]
    - [[#declare-personal-prefix][Declare personal prefix]]
    - [[#line-spacing-1][line-spacing]]
    - [[#pointer-position][Pointer position]]
    - [[#scratch-buffer-1][Scratch buffer]]
    - [[#working-with-overlays][Working with overlays]]
      - [[#an-actual-overlay-package][An actual overlay package]]
      - [[#view-largest-overlay][View largest overlay]]
      - [[#removing-overlays][Removing overlays]]
      - [[#keymap][Keymap]]
    - [[#fill-column-1][Fill column]]
    - [[#call-indicator][Call indicator]]
- [[#experimental-packages][Experimental packages]]
  - [[#helm][helm]]
  - [[#vertico][Vertico]]
  - [[#ido][Ido]]
- [[#fixes][Fixes]]
  - [[#too-many-open-files][Too many open files]]
  - [[#dap-mode-overwriting-margin-clicks][Dap mode overwriting margin clicks]]
  - [[#magit-error-message][Magit error message]]
  - [[#cant-search-org-files-with-evil-search][Can't search org files with evil search]]
  - [[#some-error-that-appeared-after-updating-doom][Some error that appeared after updating doom]]
  - [[#remove-cl-deprecation-warning-from-startup][Remove cl deprecation warning from startup]]
  - [[#lsp-modes-breadcrumb-header-line-shows-the-current-file-on-all-windows][LSP mode's breadcrumb header line shows the current file on all windows]]
- [[#shadowed-packages][Shadowed packages]]
- [[#auto-tangle][Auto Tangle]]
#+END_QUOTE

* File setup                                                :init:
This sets up all the files used for configuration with the appropriate elisp file headers.
** Initialization
=init.el= is for anything that needs to be set up prior to emacs running. Generally only the doom module settings go in here.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/init.el
;;; init.el -*- lexical-binding: t; -*-
#+end_src

** Packages
=packages.el= is for any packages that need to be downloaded have to be declared in here. They are then downloaded or updated whenever ~doom sync~ is run.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el
#+end_src

** Configuration
=config.el= is the default file for stuff to be written to. this is where basically all emacs settings get put.
#+begin_src emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
#+end_src

*** Benchmarking
This needs to be at the top of the file so that it can profile the rest of the loading sequence. Only used when running in ~debug-init~ mode.
#+begin_src emacs-lisp
(when init-file-debug
  (require 'benchmark-init)
  (add-hook 'doom-first-input-hook #'benchmark-init/deactivate))
#+end_src

To use it, start up emacs using ~emacs --debug-init~ and then view the results with ~M-x benchmark-init/show-durations-tabuled~ or ~M-x benchmark-init/show-durations-tree~.

* Doom Initialization                                       :doom:
** Documentation
This documentation came with the original doom init file. Keeping for reference. It has been slightly modified to use org markdown syntax.

#+begin_quote
This file controls what Doom modules are enabled and what order they load in. Remember to run ~doom sync~ after modifying it!

*NOTE* Press ~SPC h d h~ (or ~C-h d h~ for non-vim users) to access Doom's documentation. There you'll find a "Module Index" link where you'll find a comprehensive list of Doom's modules and what flags they support.

*NOTE* Move your cursor over a module's name (or its flags) and press ~K~ (or ~C-c c k~ for non-vim users) to view its documentation. This works on flags as well (those symbols that start with a plus).

Alternatively, press ~gd~ (or ~C-c c d~) on a module to browse its directory (for easy access to its source code).
#+end_quote

I will note that when looking at this literate config within emacs, just pressing ~K~ over a module's name does not work. you have to go through doom's module help section ~SPC h d m~.

** Start
This entire section needs to be wrapped in the ~doom!~ macro so the head is placed here so that the following sections can be more modular.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/init.el
(doom!
;;; Modules to load
#+end_src

** Input
Modules in this category extend Emacs support for additional keyboard layouts and input methods for non-english languages.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/init.el
       :input
       ;;bidi              ; (tfel ot) thgir etirw uoy gnipleh
       ;;chinese           ; spend your 3 hours a week in Emacs
       ;;japanese          ; ah, a man of culture
       ;;layout            ; auie,ctsrnm is the superior home row
#+end_src

** Completion
These modules provide interfaces and frameworks completion, including code completion.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/init.el
       :completion
       (company +childframe); the ultimate code completion backend
       ;;helm              ; the *other* search engine for love and life
       ;;ido               ; the other *other* search engine...
       ivy               ; a search engine for love and life
       ;;(vertico +icons   ; tomorrow's search engine
       ;;         +childframe)
#+end_src

