configs/.doom.d/init.el
;;; init.el -*- lexical-binding: t; -*-

(doom!
;;; Modules to load

       :input
       ;;bidi              ; (tfel ot) thgir etirw uoy gnipleh
       chinese           ; spend your 3 hours a week in Emacs
       ;;japanese          ; ah, a man of culture
       ;;layout            ; auie,ctsrnm is the superior home row

       :completion
       (company +childframe); the ultimate code completion backend
       ;;helm              ; the *other* search engine for love and life
       ;;ido               ; the other *other* search engine...
       ivy               ; a search engine for love and life
       (vertico +icons   ; tomorrow's search engine
                +childframe)

       :ui
