tangleDocs/emacs.org
** UI
For modules concerned with changing Emacs' appearance or providing interfaces for its features, like sidebars, tabs, or fonts.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/init.el
       :ui
       deft              ; notational velocity for Emacs
       doom              ; what makes DOOM look the way it does
       doom-dashboard    ; a nifty splash screen for Emacs
       doom-quit         ; DOOM quit-message prompts when you quit Emacs
       (emoji +ascii     ;💩 in the text
              +github
              +unicode)
       hl-todo           ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW
       ;;hydra             ; Discount modality for mythological beast hunters
       indent-guides     ; highlighted indent columns
       (ligatures        ; ligatures and symbols to make your code pretty again
        +extra
        +hasklig)
       minimap           ; a map for lost programmers
       modeline          ; snazzy, Atom-inspired modeline, plus API
       nav-flash         ; blink cursor line after big motions
       neotree           ; a project drawer, like NERDTree for vim
       ophints           ; highlight the region an operation acts on
       (popup            ; tame sudden yet inevitable temporary windows
        +defaults)
       ;;tabs              ; a tab bar for Emacs
       (treemacs +lsp)   ; a project drawer, like neotree but cooler
       unicode           ; extended unicode support for various languages
       (vc-gutter +pretty); vcs diff in the fringe
       vi-tilde-fringe   ; fringe tildes to mark beyond EOB
       window-select     ; visually switch windows
       workspaces        ; tab emulation, persistence & separate workspaces
       zen               ; distraction-free coding or writing
#+end_src

** Editor tools
For modules concerned with the insertion and editing of text. Amen.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/init.el
       :editor
       (evil +everywhere); come to the dark side, we have cookies
       file-templates    ; auto-snippets for empty files
       ;;fold              ; (nigh) universal code folding
       (format +onsave)  ; automated prettiness
       ;;god               ; run Emacs commands without modifier keys
       ;;lispy             ; vim for lisp, for people who don't like vim
       multiple-cursors  ; editing in many places at once
       ;;objed             ; text object editing for the innocent
       ;;parinfer          ; turn lisp into python, sort of
       rotate-text       ; cycle region at point between text candidates
       snippets          ; my elves. They type so I don't have to
       word-wrap         ; soft wrapping with language-aware indent
#+end_src

** Emacs
Modules in this category augment and extend the built-in features of Emacs.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/init.el
       :emacs
       (dired +icon)     ; making dired pretty [functional]
       electric          ; smarter, keyword-based electric-indent
       ibuffer           ; interactive buffer management
       undo              ; persistent, smarter undo for your inevitable mistakes
       vc                ; version-control and Emacs, sitting in a tree
#+end_src

** Terminals
What's an operating system without a terminal? The modules in this category bring varying degrees of terminal emulation into Emacs.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/init.el
       :term
       eshell            ; the elisp shell that works everywhere
       shell             ; simple shell REPL for Emacs
       term              ; basic terminal emulator for Emacs
       vterm             ; the best terminal emulation in Emacs
#+end_src

** Checkers
For modules dedicated to linting plain text (primarily code and prose).
#+begin_src emacs-lisp :tangle ../configs/.doom.d/init.el
       :checkers
       grammar           ; tasing grammar mistake every you make
       (spell +aspell    ; tasing you for misspelling mispelling
              +everywhere)
       syntax            ; tasing you for every semicolon you forget
#+end_src

** Tools
Modules that integrate external tools into Emacs.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/init.el
       :tools
       ;;ansible           ; Allow silly people to focus on silly things
       biblio            ; writes a PhD for you (citation needed)
       (debugger +lsp)   ; stepping through code, to help you add bugs
       direnv            ; integrates direnv into Emacs
       (docker +lsp)     ; yo dawg, I heard you like OSes, so I...
       editorconfig      ; let someone else argue about tabs vs spaces
       ein               ; tame Jupyter notebooks with emacs
       (eval +overlay)   ; run code, run (also, repls)
       ;;gist              ; interacting with github gists
       (lookup +offline  ; navigate your code and its documentation
               +dictionary)
       lsp               ; M-x vscode
       magit             ; a git porcelain for Emacs
       make              ; run make tasks from Emacs
       pass              ; password manager for nerds
       pdf               ; pdf enhancements
       ;;prodigy           ; No sweatshop is complete without child processes
       rgb               ; creating color strings
       taskrunner        ; taskrunner for all your projects
       terraform         ; infrastructure as code
       tmux              ; an API for interacting with tmux
       tree-sitter       ; syntax and parsing, sitting in a tree
       upload            ; map local to remote projects via ssh/ftp
#+end_src

** OS
Modules in this category are designed to improve compatibility with certain operating systems or OS features (like the shell).
#+begin_src emacs-lisp :tangle ../configs/.doom.d/init.el
       :os
       (:if IS-MAC macos)  ; improve compatibility with macOS
       tty               ; improve the terminal Emacs experience
#+end_src

