tangleDocs/emacs.org
** Programming Languages
These modules specialize in integration particular languages and their ecosystems into (Doom) Emacs.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/init.el
       :lang
       ;;agda              ; types of types of types of types...
       ;;beancount         ; mind the GAAP
       (cc +lsp          ; C/C++/Obj-C madness
           +tree-sitter)
       (clojure +lsp)    ; java with a lisp
       common-lisp       ; if you've seen one lisp, you've seen them all
       ;;coq               ; proofs-as-programs
       ;;crystal           ; ruby at the speed of c
       ;;(csharp +lsp)     ; unity, .NET, and mono shenanigans
       ;;(dart +flutter)   ; paint ui and not much else
       data              ; config/data formats
       ;;dhall             ; config as code
       (elixir +lsp      ; erlang done right
               +tree-sitter)
       (elm +lsp         ; care for a cup of TEA?
            +tree-sitter)
       emacs-lisp        ; a parsel-tongue for the oldest serpent
       (erlang +lsp)     ; an elegant language for a more civilized age
       (ess +stan)       ; emacs speaks statistics
       ;;factor
       ;;faust             ; dsp, but you get to keep your soul
       ;;fortran           ; in FORTRAN, GOD is REAL (unless declared INTEGER)
       ;;fsharp            ; ML stands for Microsoft's Language
       ;;fstar             ; (dependent) types and (monadic) effects and Z3
       ;;gdscript          ; the language you waited for
       (go +lsp          ; the hipster dialect
           +tree-sitter)
       ;;graphql           ; give queries a REAT
       (haskell +lsp)    ; a language that's lazier than I am
       ;;hy                ; readability of scheme w/ speed of python
       ;;idris             ; a language you can depend on
       (java +lsp        ; the poster child for carpal tunnel syndrome
             +tree-sitter)
       (javascript +lsp  ; all(hope(abandon(ye(who(enter(here))))))
                   +tree-sitter)
       (json +lsp        ; At least it ain't XML
             +tree-sitter)
       ;;(julia +lsp)      ; a better, faster MATLAB
       (kotlin +lsp)     ; a better, slicker Java(Script)
       (latex +lsp       ; writing papers in Emacs has never been so fun
              +latexmk
              +cdlatex
              +fold)
       ;;lean              ; for folks with too much to prove
       ledger            ; an accounting system in Emacs
       (lua +lsp         ; one-based indices? one-based indices
            +fennel
            +moonscript)
       (markdown +grip)  ; writing docs for people to ignore
       ;;nim               ; python + lisp at the speed of c
       ;;nix               ; I hereby declare "nix geht mehr!"
       (ocaml +lsp       ; an objective camel
              +tree-sitter)
       (org +brain       ; organize your plain life in plain text
            +dragndrop
            +gnuplot
            +ipython
            +journal
            +jupyter
            +noter
            +pandoc
            +pomodoro
            +present
            +pretty
            +roam2)
       ;;php               ; perl's insecure younger brother
       plantuml          ; diagrams for confusing people more
       (purescript +lsp) ; javascript, but functional
       (python +lsp      ; beautiful is better than ugly
               +poetry
               +pyenv
               +pyright
               +tree-sitter)
       ;;qt                ; the 'cutest' gui framework ever
       (racket +lsp      ; a DSL for DSLs
               +xp)
       ;;raku              ; the artist formerly known as perl6
       (rest +jq)        ; Emacs as a REST client
       rst               ; ReST in peace
       (ruby +rails      ; 1.step {|i| p "Ruby is #{i.even? ? 'love' : 'life'}"}
             +rvm
             +rbenv
             +lsp
             +tree-sitter)
       (rust +lsp)       ; Fe2O3.unwrap().unwrap().unwrap().unwrap()
       (scala +lsp)      ; java, but good
       scheme            ; a fully conniving family of lisps
       (sh +lsp          ; she sells {ba,z,fi}sh shells on the C xor
           +tree-sitter)
       sml               ; Standard ML
       ;;solidity          ; do you need a blockchain? No.
       ;;(swift +lsp)      ; who asked for emoji variables?
       ;;terra             ; Earth and Moon in alignment for performance.
       (web +lsp         ; the tubes
            +tree-sitter)
       (yaml +lsp)       ; JSON, but readable
       ;;(zig +lsp)        ; C, but simpler
#+end_src

** Email
Modules that turn Emacs in an email client.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/init.el
       :email
       (mu4e +gmail)     ; the great filter Hanson hadn't anticipated
       ;;notmuch           ; closest Emacs will ever be to multi-threaded
       (wanderlust +gmail); to boldly go where no mail has gone before
#+end_src

** App
Application modules are complex and opinionated modules that transform Emacs
toward a specific purpose. They may have additional dependencies and *should be
loaded last* (but before [[doom-module:][:config]] modules).
#+begin_src emacs-lisp :tangle ../configs/.doom.d/init.el
       :app
       calendar          ; Watch your missed deadlines in real time
       ;;emms              ; a media player for music no one's heard of
       ;;everywhere        ; leave Emacs!? You must be joking
       irc               ; how neckbeards socialize
       (rss +org)        ; emacs as an RSS reader
       twitter           ; twitter client https://twitter.com/vnought
#+end_src

** Config
Modules in this category provide sane defaults or improve your ability to configure Emacs. It is best to load these last.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/init.el
       :config
       (default +bindings; reasonable defaults for reasonable people
                +smartparens)
       ;;literate          ; Disguise your config as poor documentation
#+end_src

** End section
Closes the ~doom!~ macro block.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/init.el
)
#+end_src

* Configuration                                             :config:
** Documentation
This documentation came with the doom emacs original configs. I'm keeping it here for reference since I often run across it while searching my config.
*** Macro documentation
Here are some additional functions/macros that could help you configure Doom:

- ~load!~ for loading external *.el files relative to this one
- ~use-package!~ for configuring packages
- ~after!~ for running code after a package has loaded
- ~add-load-path!~ for adding directories to the ~load-path~, relative to
  this file. Emacs searches the ~load-path~ when you load packages with
  ~require~ or ~use-package~.
- ~map!~ for binding new keys

To get information about any of these functions/macros, move the cursor over
the highlighted symbol at press ~K~ (non-evil users must press ~C-c c k~).
This will open documentation for it, including demos of how they are used.

You can also try ~gd~ (or ~C-c c d~) to jump to their definition and see how
they are implemented.

*** Packages documentation
To install a package with Doom you must declare them here and run ~doom sync~
on the command line, then restart Emacs for the changes to take effect -- or
use ~M-x doom/reload~.

To install SOME-PACKAGE from MELPA, ELPA or emacsmirror:
#+begin_src emacs-lisp :tangle no
(package! some-package)
#+end_src

To install a package directly from a remote git repo, you must specify a
~:recipe~. You'll find documentation on what ~:recipe~ accepts on the [[https://github.com/raxod502/straight.el#the-recipe-format][straight docs]].
#+begin_src emacs-lisp :tangle no
(package! another-package
  :recipe (:host github :repo "username/repo"))
#+end_src

If the package you are trying to install does not contain a PACKAGENAME.el
file, or is located in a sub-directory of the repo, you'll need to specify
~:files~ in the ~:recipe~:
#+begin_src emacs-lisp :tangle no
(package! this-package
  :recipe (:host github :repo "username/repo"
           :files ("some-file.el" "src/lisp/*.el")))
#+end_src

If you'd like to disable a package included with Doom, you can do so here
with the ~:disable~ property:
#+begin_src emacs-lisp :tangle no
(package! builtin-package :disable t)
#+end_src

You can override the recipe of a built in package without having to specify
all the properties for ~:recipe~. These will inherit the rest of its recipe
from Doom or MELPA/ELPA/Emacsmirror:
#+begin_src emacs-lisp :tangle no
(package! builtin-package :recipe (:nonrecursive t))
(package! builtin-package-2 :recipe (:repo "myfork/package"))
#+end_src

Specify a ~:branch~ to install a package from a particular branch or tag.
This is required for some packages whose default branch isn't =master= (which
our package manager can't deal with; see raxod502/straight.el#279)
#+begin_src emacs-lisp :tangle no
(package! builtin-package :recipe (:branch "develop"))
#+end_src

Use ~:pin~ to specify a particular commit to install.
#+begin_src emacs-lisp :tangle no
(package! builtin-package :pin "1a2b3c4d5e")
#+end_src

Doom's packages are pinned to a specific commit and updated from release to
release. The ~unpin!~ macro allows you to unpin single packages...
#+begin_src emacs-lisp :tangle no
(unpin! pinned-package)
#+end_src

...or multiple packages
#+begin_src emacs-lisp :tangle no
(unpin! pinned-package another-pinned-package)
#+end_src

...Or *all* packages (*NOT RECOMMENDED*; will likely break things)
#+begin_src emacs-lisp :tangle no
(unpin! t)
#+end_src

** Basic Emacs settings
Settings for the general emacs editor and experience. These packages don't affect anything that is package or use case dependent, but instead set up the emacs program as desired.
*** Personal Identification
Some functionality uses this to identify you, e.g. GPG configuration, email clients, file templates and snippets.
#+begin_src emacs-lisp
(setq user-full-name "Samuel Jackson"
      user-mail-address (concat "dsiq3g" "@" "gmail.com"))
#+end_src

*** Fonts and language
Having the correct fonts and language support is so important in emacs. This section provides control for it.
**** Chinese support
In order for Chinese text to be displayed correctly, some modes needs to be turned on to allow for the unique characteristics of the symbolic language.
#+begin_src emacs-lisp
(defun local/chinese-text-support ()
  "Turn on modes to support chinese text in the buffer. May cause other text to change characteristics as well."
  (interactive)
  (variable-pitch-mode))
#+end_src

