configs/.doom.d/init.el
       ;;agda              ; types of types of types of types...
       ;;beancount         ; mind the GAAP
       (cc +lsp          ; C/C++/Obj-C madness
           +tree-sitter)
       (clojure +lsp)    ; java with a lisp
       common-lisp       ; if you've seen one lisp, you've seen them all
       ;;coq               ; proofs-as-programs
       ;;crystal           ; ruby at the speed of c
       ;;csharp            ; unity, .NET, and mono shenanigans
       ;;(dart +flutter)   ; paint ui and not much else
       data              ; config/data formats
       ;;dhall             ; config as code
       (elixir +lsp      ; erlang done right
               +tree-sitter)
       (elm +lsp         ; care for a cup of TEA?
            +tree-sitter)
       emacs-lisp        ; a parsel-tongue for the oldest serpent
       (erlang +lsp)     ; an elegant language for a more civilized age
       (ess +stan)       ; emacs speaks statistics
       ;;factor
       ;;faust             ; dsp, but you get to keep your soul
       ;;fortran           ; in FORTRAN, GOD is REAL (unless declared INTEGER)
       ;;fsharp            ; ML stands for Microsoft's Language
       ;;fstar             ; (dependent) types and (monadic) effects and Z3
       ;;gdscript          ; the language you waited for
       (go +lsp          ; the hipster dialect
           +tree-sitter)
       ;;graphql           ; give queries a REAT
       (haskell +lsp)    ; a language that's lazier than I am
       ;;hy                ; readability of scheme w/ speed of python
       ;;idris             ; a language you can depend on
       (java +lsp        ; the poster child for carpal tunnel syndrome
             +tree-sitter)
       (javascript +lsp  ; all(hope(abandon(ye(who(enter(here))))))
                   +tree-sitter)
       (json +lsp        ; At least it ain't XML
             +tree-sitter)
       ;;(julia +lsp)      ; a better, faster MATLAB
       (kotlin +lsp)     ; a better, slicker Java(Script)
       (latex +lsp       ; writing papers in Emacs has never been so fun
              +latexmk
              +cdlatex
              +fold)
       ;;lean              ; for folks with too much to prove
       ledger            ; an accounting system in Emacs
       (lua +lsp         ; one-based indices? one-based indices
            +fennel
            +moonscript)
       (markdown +grip)  ; writing docs for people to ignore
       ;;nim               ; python + lisp at the speed of c
       ;;nix               ; I hereby declare "nix geht mehr!"
       (ocaml +lsp       ; an objective camel
              +tree-sitter)
       (org +brain       ; organize your plain life in plain text
            +dragndrop
            +gnuplot
            +ipython
            +journal
            +jupyter
            +noter
            +pandoc
            +pomodoro
            +present
            +pretty
            +roam2)
       ;;php               ; perl's insecure younger brother
       plantuml          ; diagrams for confusing people more
       (purescript +lsp) ; javascript, but functional
       (python +lsp      ; beautiful is better than ugly
               +poetry
               +pyenv
               +pyright
               +tree-sitter)
       ;;qt                ; the 'cutest' gui framework ever
       (racket +lsp      ; a DSL for DSLs
               +xp)
       ;;raku              ; the artist formerly known as perl6
       (rest +jq)        ; Emacs as a REST client
       rst               ; ReST in peace
       (ruby +rails      ; 1.step {|i| p "Ruby is #{i.even? ? 'love' : 'life'}"}
             +rvm
             +rbenv
             +lsp
             +tree-sitter)
       (rust +lsp)       ; Fe2O3.unwrap().unwrap().unwrap().unwrap()
       (scala +lsp)      ; java, but good
       scheme            ; a fully conniving family of lisps
       (sh +lsp          ; she sells {ba,z,fi}sh shells on the C xor
           +tree-sitter)
       ;;sml
       ;;solidity          ; do you need a blockchain? No.
       ;;swift             ; who asked for emoji variables?
       ;;terra             ; Earth and Moon in alignment for performance.
       (web +lsp         ; the tubes
            +tree-sitter)
       (yaml +lsp)       ; JSON, but readable
       ;;zig               ; C, but simpler

       :email
       (mu4e +gmail)     ; the great filter Hanson hadn't anticipated
       ;;notmuch           ; closest Emacs will ever be to multi-threaded
       (wanderlust +gmail); to boldly go where no mail has gone before

       :app
       calendar          ; Watch your missed deadlines in real time
       ;;emms              ; a media player for music no one's heard of
       ;;everywhere        ; leave Emacs!? You must be joking
       irc               ; how neckbeards socialize
       (rss +org)        ; emacs as an RSS reader
       twitter           ; twitter client https://twitter.com/vnought

       :config
       (default +bindings; reasonable defaults for reasonable people
                +smartparens)
       ;;literate          ; Disguise your config as poor documentation

)
